taurus/scenarios.yml
execution:
- concurrency: 50
  # iterations: 100
  ramp-up: 15s
  hold-for: 10m
  # throughput: 100
  scenario: openjdk-11
- concurrency: 50
  # iterations: 100
  ramp-up: 15s
  hold-for: 10m
  # throughput: 100
  scenario: graalvm-19-11
- concurrency: 50
  # iterations: 100
  ramp-up: 15s
  hold-for: 10m
  # throughput: 100
  scenario: graalvm-20-11
- concurrency: 50
  # iterations: 100
  ramp-up: 15s
  hold-for: 10m
  # throughput: 100
  scenario: openj9-11
- concurrency: 50
  # iterations: 100
  ramp-up: 15s
  hold-for: 10m
  # throughput: 100
  scenario: openj9-11-tuned

scenarios:
  openjdk-11:
    requests:
    - http://openjdk-11:8080/greetings
  graalvm-19-11:
    requests:
    - http://graalvm-11:8080/greetings
  graalvm-20-11:
    requests:
    - http://graalvm-11:8080/greetings
  openj9-11:
    requests:
    - http://openj9-11:8080/greetings
  openj9-11-tuned:
    requests:
    - http://openj9-11-tuned:8080/greetings